Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འདས་པ་ན་དམན་པ་ལ་བརྟེན་ལ་མ་འོངས་པ་ནི་ཁྱད་པར་ལ་བརྟེན་པར་འགྱུར་བ་ཡང་ཡོད། ད་ལྟར་བྱུང་བ་ན་དམན་པ་ལ་བརྟེན་ལ། མ་འོངས་པ་ན་ཁྱད་པར་ལ་བརྟེན་པར་འགྱུར་བ་ཡང་ཡོད།
en: There are also, contingent on an inferior one in the past, those that will be contingent on a superior one in the future.

source: ད་ལྟར་བྱུང་བ་ན་ཁྱད་པར་ལ་བརྟེན་ལ། མ་འོངས་པ་ན་དམན་པ་ལ་བརྟེན་པར་འགྱུར་བ་ཡང་ཡོད། ད་ལྟར་བྱུང་བ་དང་། མ་འོངས་པ་ན་ཡང་དམན་པ་ལ་བརྟེན་པར་འགྱུར་བ་ཡང་ཡོད།
en: There are also, contingent on an inferior one in the present, those that will be contingent on a superior one in the future.

source: ད་ལྟར་བྱུང་བ་དང་། མ་འོངས་པ་ན་ཡང་ཁྱད་པར་ལ་བརྟེན་པར་འགྱུར་བ་ཡོད། འདས་པ་ན་སྦྱོར་བ་ཆུང་ལ་མ་འོངས་པ་ན་སྦྱོར་བ་རྒྱ་ཆེན་པོར་འགྱུར་བ་དང་། འདས་པ་ན་སྦྱོར་བ་རྒྱ་ཆེ་ལ།
en: There are also, contingent on a superior one in the present, those that will be contingent on an inferior one in the future.

source: མ་འོངས་པ་ན་སྦྱོར་བ་ཆུང་བ་དང་། རྩོམ་པ་ཆུང་ལ་ཁྱད་པར་ཆེན་པོར་འགྱུར་བ་དང་། རྩོམ་པ་ཆེ་ལ་ཁྱད་པར་དུ་ཆུང་བ་དང་། ཉན་ཐོས་སུ་འགྱུར་བའི་རྒྱུ་དང་། རང་སངས་རྒྱས་སུ་འགྱུར་བའི་རྒྱུ་དང་། སངས་རྒྱས་སུ་འགྱུར་བའི་རྒྱུ་དང་། ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ།
en: There are also, in the present and the future, those that will be contingent on an inferior one.

source: མ་འོངས་པ་ན་རྣམ་པར་སྨིན་པ་བདེ་བ་དང་། ད་ལྟར་བྱུང་བ་ན་བདེ་ལ།
en: There are also, in the present and the future, those that will be contingent on a superior one.

source: མ་འོངས་པ་ན་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་དང་། ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ། མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་དང་། ད་ལྟར་བྱུང་བ་ན་ཡང་བདེ་ལ། མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་ཡང་ཡོད་དོ།
en: And there are also the slight preparation in the past that will be an immense preparation in the future and the immense preparation in the past that will be a slight preparation in the future; as well as the small undertaking that becomes extremely special; the great undertaking that becomes much less special; the undertaking of action that is the cause of becoming a śrāvaka, the cause of becoming a pratyekabuddha, or the cause of becoming a buddha; that is done with suffering in the present and that matures into pleasure in the future; that is done with pleasure in the present and that matures into suffering in the future; that is done with suffering in the present and that matures into suffering in the future as well; and that is done with pleasure in the present and that matures into pleasure in the future as well.

source: །ད་ལྟར་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་རྣམས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་གང་ཡིན་པ་དང་། རྒྱུ་གང་ཡིན་པ་དང་། རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་རྣམས་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ།
en: Thus, whatever the action, whatever the cause, whatever the maturation of all beings in times past, future, and present—the tathāgata knows them all.

source: །འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་དང་། འཇིག་རྟེན་གྱི་ཁམས་དུ་མ་ཞེས་བྱ་བ་ནི་ལྷག་པའི་བསམ་པའི་ཁམས་གང་དང་གང་གིས་འཇིག་རྟེན་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་སོགས་པ་དང་། མི་གཡོ་བ་མངོན་པར་འདུ་བྱེད་པ་{སྩོགས་,སོགས་}པ་དང་། སྐྱེ་བ་{སྩོགས་,སོགས་}པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་{སྩོགས་,སོགས་}པ་དང་། ཉོན་མོངས་པ་རྣམས་{སྩོགས་,སོགས་}པ་དང་། ལྟ་བ་རྣམས་{སྩོགས་,སོགས་}པ་དང་། ངེས་པར་འབྱུང་བ་{སྩོགས་,སོགས་}པ་དང་། ཉན་ཐོས་སུ་འགྱུར་བའི་རྒྱུ་{སྩོགས་,སོགས་}པ་དང་། རང་སངས་རྒྱས་སུ་འགྱུར་བའི་རྒྱུ་{སྩོགས་,སོགས་}པ་དང་། སངས་རྒྱས་སུ་འགྱུར་བའི་རྒྱུ་{སྩོགས་,སོགས་}པ་དང་། འབྱུང་བའི་རྒྱུ་{སྩོགས་,སོགས་}པ་དང་། འཇིག་པའི་རྒྱུ་{སྩོགས་,སོགས་}པའི་ལྷག་པའི་བསམ་པའི་ཁམས་དེ་ཡང་མཁྱེན་ཏོ། །མིག་གི་ཁམས་དང་།
en: Third power “The world with its various constituents and multiplicity of constituents”— they know with which disposition constituent there is an accumulation of the enactment of ordinary merit, and with which disposition constituent there is an accumulation of the immovable, an accumulation of births, an accumulation of freedom from attachment, an accumulation of afflictions, an accumulation of views, an accumulation of definite emergence, an accumulation of the causes of becoming a śrāvaka, an accumulation of the causes of becoming a pratyekabuddha, an accumulation of the causes of becoming a buddha, an accumulation of the causes of arising, and an accumulation of the causes of destruction.

source: གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ནས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དག་ནི་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་།
en: They know that the eye constituent, form constituent, and eye consciousness constituent, up to the thinking-mind constituent, dharma constituent, and thinking-mind consciousness constituent, are inner emptinesses, outer emptinesses, and inner and outer emptinesses; they know that the earth element, water element, fire element, wind element, space element, and consciousness element are like a magical illusion and a dream.

source: ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ནི་སྒྱུ་མ་དང་རྨི་ལམ་ལྟ་བུར་རབ་ཏུ་མཁྱེན་ཏོ། །འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་དག་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་ལས་བྱུང་བར་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know the desire realm, form realm, and formless realm that come about from the falsely imagined unreal.

source: །འདུས་བྱས་ཀྱི་ཁམས་ནི་ཀུན་བརྟགས་པས་མངོན་པར་འདུས་བྱས་པའི་མཚན་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ནི་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know that the compounded element is marked as brought about by the falsely imagined, and that the uncompounded element is marked as not being brought about.

source: །ཉོན་མོངས་པའི་ཁམས་ནི་གློ་བུར་གྱི་མཚན་ཉིད་དང་། རྣམ་པར་བྱང་བའི་ཁམས་ནི་རང་བཞིན་འོད་གསལ་བའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know that the defilement element is marked by being plucked out of thin air, and that the purification element is marked by the nature of clear light.

source: །འདུ་བྱེད་ཀྱི་ཁམས་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་མ་རིག་པའི་མཚན་ཉིད་དང་། མྱ་ངན་ལས་འདས་པའི་ཁམས་ནི་ཚུལ་བཞིན་ཏེ། རིག་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know that the compounded element is marked by ignorance that is not fundamental, and that the nirvāṇa element is marked by being fundamental awareness.

source: །མཁྱེན་ནས་ཀྱང་དེ་ལྟ་དེ་ལྟ་བུར་ཆོས་སྟོན་ཏེ།
en: They know and teach dharmas like those.

source: འདི་ནི་ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་སོ།
en: This is the power of knowing “various constituents.”

source: །སེམས་ཅན་གཞན་དག་དང་གང་ཟག་གཞན་རྣམས་ཀྱི་མོས་པ་སྣ་ཚོགས་དང་། མོས་པ་དུ་མ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་འདོད་ཆགས་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ་འདོད་ཆགས་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ་གཏི་མུག་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ་འདོད་ཆགས་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ་གཏི་མུག་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་།
en: Fourth power “Accurately knowing the various beliefs and the many beliefs of other beings and other persons.”

source: འདོད་ཆགས་ལ་གནས་ལ་འདོད་ཆགས་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་གནས་ལ། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ་འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ་ཞེ་སྡང་དང་གཏི་མུག་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ། འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ། འདོད་ཆགས་དང་། ཞེ་སྡང་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་གཏི་མུག་ལ་གནས་ལ། འདོད་ཆགས་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ། འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ། འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་གཏི་མུག་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་གནས་ལ། གཏི་མུག་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་གནས་ལ། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་གཏི་མུག་ལ་གནས་ལ། འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། ཞེ་སྡང་དང་གཏི་མུག་ལ་གནས་ལ། ཞེ་སྡང་དང་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ལ་གནས་ལ། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་
en: They know who has an inherited disposition for attachment but an inclination to anger; an inherited disposition for anger but an inclination to attachment; an inherited disposition for attachment but an inclination to ignorance; an inherited disposition for ignorance but an inclination to attachment; an inherited disposition for anger but an inclination to ignorance; an inherited disposition for ignorance but an inclination to anger; an inherited disposition for attachment and an inclination to attachment; an inherited disposition for anger and an inclination to anger; an inherited disposition for ignorance and an inclination to ignorance; an inherited disposition for attachment and anger and an inclination to attachment and anger; an inherited disposition for attachment but an inclination to attachment and ignorance; an inherited disposition for attachment but an inclination to anger and ignorance; an inherited disposition for anger but an inclination to attachment and ignorance; an inherited disposition for anger but an inclination to attachment and anger; an inherited disposition for attachment and ignorance but an inclination to attachment; an inherited disposition for attachment but an inclination to attachment and ignorance; an inherited disposition for anger but an inclination to attachment and ignorance; an inherited disposition for attachment and ignorance but an inclination to anger; an inherited disposition for attachment and anger but an inclination to ignorance; an inherited disposition for ignorance but an inclination to attachment and anger; an inherited disposition for attachment and anger and an inclination to attachment and anger; an inherited disposition for attachment and ignorance and an inclination to attachment and ignorance; an inherited disposition for anger and ignorance and an inclination to anger and ignorance; an inherited disposition for attachment, anger, and ignorance and an inclination to attachment, anger, and ignorance; an inherited disposition for attachment but an inclination to pride; an inherited disposition for anger but an inclination to pride; an inherited disposition for ignorance but an inclination to pride; an inherited disposition for pride and an inclination to pride; an inherited disposition for pride but an inclination to attachment; an inherited disposition for pride but an inclination to anger; an inherited disposition for pride but an inclination to ignorance; an inherited disposition for pride but an inclination to attachment and anger; an inherited disposition for pride but an inclination to attachment and ignorance; an inherited disposition for pride but an inclination to attachment, anger, and ignorance; an inherited disposition for attachment and anger but an inclination to pride; an inherited disposition for attachment and ignorance but an inclination to pride; an inherited disposition for anger and ignorance but an inclination to pride; an inherited disposition for attachment but an inclination to wrong view; an inherited disposition for anger but an inclination to wrong view; an inherited disposition for ignorance but an inclination to wrong view; an inherited disposition for pride but an inclination to wrong view; an inherited disposition for wrong view and an inclination to wrong view; an inherited disposition for wrong view but an inclination to attachment; an inherited disposition for wrong view but an inclination to anger; an inherited disposition for wrong view but an inclination to ignorance; an inherited disposition for wrong view but an inclination to pride; an inherited disposition for wrong view but an inclination to attachment and anger; an inherited disposition for wrong view but an inclination to attachment and ignorance; an inherited disposition for wrong view but an inclination to attachment and pride; an inherited disposition for wrong view but an inclination to attachment and wrong view; an inherited disposition for wrong view but an inclination to anger and ignorance; an inherited disposition for wrong view but an inclination to anger and pride; an inherited disposition for anger but an inclination to anger and wrong view; an inherited disposition for wrong view but an inclination to ignorance and wrong view; an inherited disposition for wrong view but an inclination to ignorance and pride; and an inherited disposition for wrong view but an inclination to pride and wrong view.

source: དང་། ཞེ་སྡང་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་འདོད་ཆགས་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་གཏི་མུག་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། འདོད་ཆགས་དང་གཏི་མུག་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། ཞེ་སྡང་དང་གཏི་མུག་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། འདོད་ཆགས་ལ་གནས་ལ་ལྟ་བ་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ་ལྟ་བ་ལ་མོས་པ་དང་། གཏི་མུག་ལ་གནས་ལ་ལྟ་བ་ལ་མོས་པ་དང་། ང་རྒྱལ་ལ་གནས་ལ་ལྟ་བ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ལྟ་བ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་འདོད་ཆགས་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ཞེ་སྡང་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་གཏི་མུག་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ང་རྒྱལ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་འདོད་ཆགས་དང་གཏི་མུག་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་འདོད་ཆགས་དང་ང་རྒྱལ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་འདོད་ཆགས་དང་ལྟ་བ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ཞེ་སྡང་དང་གཏི་མུག་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ཞེ་སྡང་དང་ང་རྒྱལ་ལ་མོས་པ་དང་། ཞེ་སྡང་ལ་གནས་ལ་ཞེ་སྡང་དང་ལྟ་བ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་གཏི་མུག་དང་ལྟ་བ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་གཏི་མུག་དང་ང་རྒྱལ་ལ་མོས་པ་དང་། ལྟ་བ་ལ་གནས་ལ་ང་རྒྱལ་དང་ལྟ་བ་ལ་མོས་པ་དང་། དེ་ལྟ་བུའི་ཚུལ་ཅན་མཐུན་པ་དག་དང་། དེ་བཞིན་དུ་མི་དགེ་བ་ལ་གནས་ལ་དགེ་བ་ལ་མོས་པ་དང་། དགེ་བ་ལ་གནས་ལ་མི་དགེ་བ་ལ་མོས་པ་དང་། མི་དགེ་བ་ལ་གནས་ལ་མི་དགེ་བ་ལ་མོས་པ་དང་། དགེ་བ་ལ་གནས་ལ་དགེ་བ་ལ་མོས་པ་དང་། སྦྱོར་བ་ཆུང་ལ་མོས་པ་རྒྱ་ཆེ་བ་དང་། སྦྱོར་བ་
en: They know those types, and, similarly, those with an inherited disposition for the unwholesome but an inclination to the wholesome; an inherited disposition for the wholesome but an inclination to the unwholesome; an inherited disposition for the unwholesome and an inclination to the unwholesome; an inherited disposition for the wholesome and an inclination to the wholesome; as well as those short on execution but big on inclination; big on execution but short on inclination; big on execution and big on inclination as well; short on execution and short on inclination as well; as well as those with a belief that makes them destined to be wrong; with a belief that makes them destined to be correct; with an inclination to move to the desire realm, an inclination to move to the form realm, an inclination to move to the formless realm, an inclination to transcend the desire realm, an inclination to transcend the form realm, an inclination to transcend the formless realm, and an inclination to transcend all three realms; those with an inclination to move from what is based on the inferior to what is based on the superior; an inclination to move from what is based on the superior to what is based on the inferior; an inclination to move from what is based on the inferior to what is based on the inferior; an inclination to move from what is based on the superior to what is based on the superior; and an inclination to existence, an inclination to escape, an inclination to the state of a śrāvaka, and an inclination to the state of a pratyekabuddha.

source: རྒྱ་ཆེ་ལ་མོས་པ་ཆུང་བ་དང་། སྦྱོར་བ་ཡང་རྒྱ་ཆེ་ལ་མོས་པ་ཡང་རྒྱ་ཆེ་བ་དང་། སྦྱོར་བ་ཡང་ཆུང་ལ་མོས་པ་ཡང་ཆུང་བ་དང་། ལོག་པ་ཉིད་དུ་ངེས་པ་ལ་མོས་པ་དང་། ཡང་དག་པ་ཉིད་དུ་ངེས་པ་ལ་མོས་པ་དང་། འདོད་པའི་ཁམས་སུ་འཕོ་བར་མོས་པ་དང་། གཟུགས་ཀྱི་ཁམས་སུ་འཕོ་བར་མོས་པ་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་འཕོ་བར་མོས་པ་དང་། འདོད་པའི་ཁམས་ལས་ཤིན་ཏུ་ཡང་དག་པར་འདའ་བར་མོས་པ་དང་། གཟུགས་ཀྱི་ཁམས་ལས་ཤིན་ཏུ་ཡང་དག་པར་འདའ་བར་མོས་པ་དང་། གཟུགས་མེད་པའི་ཁམས་ལས་ཤིན་ཏུ་ཡང་དག་པར་འདའ་བར་མོས་པ་དང་། ཁམས་གསུམ་ཆར་ལས་ཤིན་ཏུ་ཡང་དག་པར་འདའ་བར་མོས་པ་དང་། དམན་པ་ལ་བརྟེན་པ་ལས་ཁྱད་པར་ལ་བརྟེན་པར་འཕོ་བར་མོས་པ་དང་། ཁྱད་པར་ལ་བརྟེན་པ་ལས་དམན་པ་ལ་བརྟེན་པར་འཕོ་བར་མོས་པ་དང་། དམན་པ་ལ་བརྟེན་པ་ལས་དམན་པ་ལ་བརྟེན་པར་འཕོ་བར་མོས་པ་དང་། ཁྱད་པར་ལ་བརྟེན་པ་ལས་ཁྱད་པར་ལ་བརྟེན་པར་འཕོ་བར་མོས་པ་དང་། སྲིད་པར་མོས་པ་དང་། འབྱུང་བར་མོས་པ་དང་། ཉན་ཐོས་ཉིད་དུ་མོས་པ་དང་། རང་སངས་རྒྱས་ཉིད་དུ་མོས་པ་དང་། དེ་ལྟ་བུ་ལ་སོགས་པའི་རྣམ་པར་མཁྱེན་ཏེ།
en: They know types such as those and so on.

source: འདི་ནི་མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་སོ།
en: This is the power of knowing “various inclinations.”

source: །སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོ་དང་བརྩོན་འགྲུས་ཀྱི་རིམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་དབང་པོ་རྟུལ་པོའོ། །འདི་ནི་དབང་པོ་བར་མའོ། །འདི་ནི་དབང་པོ་རྣོན་པོའོ། །འདི་ནི་དབང་པོ་མེད་པའོ། །འདི་ནི་དབང་པོ་དམན་པའོ། །འདི་ནི་དབང་པོ་ཁྱད་པར་ཅན་ནོ། །ཀུན་བརྟགས་པའི་དབང་པོ་འདིས་འདོད་ཆགས་འབྱུང་ངོ་། །འདིས་ཞེ་སྡང་ངོ་། །འདིས་གཏི་མུག་གོ། །འདིས་ང་རྒྱལ་ལོ། །འདིས་ལྟ་བའོ།
en: Fifth power “Accurately knowing the stages of faculties and perseverance of other beings and other persons.”

source: །འདིས་ཉོན་མོངས་པ་ཆུང་ངུ་འབྱུང་ངོ་། །འདིས་ཉོན་མོངས་པ་འབྲིང་ངོ་། །འདིས་ཉོན་མོངས་པ་ཆེན་པོ་འབྱུང་ངོ་། །འདིས་སྐལ་བ་ཡོད་པར་འགྱུར་རོ། །འདིས་སྐལ་བ་མེད་པར་འགྱུར་རོ། །འདིས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །འདི་རེ་ཞིག་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །འདིས་སྐྱོན་ཆུང་ངུར་འགྱུར་རོ། །འདིས་རེ་ཞིག་སྐྱོན་ཆུང་ངུར་འགྱུར་རོ། །འདིས་དགེ་བ་རྣམས་ལ་སོགས་པར་འགྱུར་རོ། །འདིས་འདོད་པ་རྣམས་སོ། །འདིས་གཟུགས་སུ་གཏོགས་པ་རྣམས་སོ། །འདིས་གཟུགས་མེད་པར་གཏོགས་པ་རྣམས་སོ། །འདིས་སྐྱོ་བའོ། །འདིས་འདོད་ཆགས་དང་བྲལ་བའོ། །འདིས་ཞི་གནས་སོ། །འདིས་ལྷག་མཐོང་ངོ་། །འདིས་རྒྱུན་དུ་ཞུགས་པའོ། །འདིས་རེ་ལྟར་ཐོགས་ན་སྲིད་པ་བདུན་པའོ། །འདིས་བར་ཆད་གཅིག་པའོ། །འདིས་རིགས་ནས་རིགས་སུ་སྐྱེ་བའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དེ་ལྟ་བུ་དང་། འདིས་མོས་པས་སྤྱོད་པའི་སའོ། །འདིས་རབ་ཏུ་དགའ་བའོ། །འདིས་དྲི་མ་མེད་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དང་། འདིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །འདིས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སྒོམ་མོ། །འདིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །འདིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: They know dull faculties, middling faculties, sharp faculties, having no faculties, inferior faculties, and superior faculties; that this faculty of imagination gives rise to attachment, this to anger, this to stupidity, this to pride, and this to wrong views; that this gives rise to small afflictions, this gives rise to middling afflictions, and this gives rise to big afflictions; that this makes for good fortune, and this makes for an absence of good fortune; that with this they reach maturity, and with this they reach maturity for the time being; that with this faults become small, and with this they become small for the time being; that this gives rise to the wholesome and so on, this to objects of the senses, this to what is included in form, and this to what is included in the formless; that this gives rise to birth, this to freedom from attachment, this to calm abiding, this to special insight, this to a stream enterer, this to being temporarily obstructed by seven suffering existences, this to having a single interruption, and this to being born in family after family and so on.

source: །འདིས་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་དོ། །འདིས་ཏིང་ངེ་འཛིན་རྣམ་པ་མང་པོ་ཐོབ་པོ། །འདིས་གཟུངས་ཀྱི་སྒོ་རྣམས་སོ། །འདིས་མངོན་པར་ཤེས་པ་རྣམས་སོ། །འདིས་དབང་པོ་རྣམས་ཐོབ་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དང་། གང་སྦྱིན་པའི་དབང་པོ་ཅན་ལ་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དང་། གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ལ་སྦྱིན་པ་ལ་སྦྱོར་བ་དང་། གང་སྦྱིན་པའི་དབང་པོ་ཅན་ལ་བཟོད་པ་ལ་སྦྱོར་བ་དང་། གང་བཟོད་པའི་དབང་པོ་ཅན་ལ་སྦྱིན་པ་ལ་སྦྱོར་བ་དང་། གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ལ་བཟོད་པ་ལ་སྦྱོར་བ་དང་། གང་བཟོད་པའི་དབང་པོ་ཅན་ལ་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དང་། གང་སྦྱིན་པའི་དབང་པོ་ཅན་ལ་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དང་། གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ལ་སྦྱིན་པ་ལ་སྦྱོར་བ་དང་། གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ལ་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དང་། གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ལ་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དང་། གང་བཟོད་པའི་དབང་པོ་ཅན་ལ་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དང་། གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ལ་བཟོད་པ་ལ་སྦྱོར་བ་དང་། གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ལ་བསམ་གཏན་ལ་སྦྱོར་བ་དང་། གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ལ་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དང་། གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ལ་སྦྱིན་པ་ལ་སྦྱོར་བ་དང་། གང་སྦྱིན་པའི་དབང་པོ་ཅན་ལ་བསམ་གཏན་ལ་སྦྱོར་བ་དང་། གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ལ་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དང་། གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ལ་བསམ་གཏན་ལ་སྦྱོར་བ་དང་། གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ལ་བཟོད་པ་ལ་སྦྱོར་བ་དང་། གང་བཟོད་པའི་དབང་པོ་ཅན་ལ་བསམ་གཏན་ལ་སྦྱོར་བ་དང་། གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ལ་སྦྱིན་པ་ལ་སྦྱོར་བ་དང་།
en: They know types such as those and so on, and that this gives rise to the devoted course of conduct level, this the Pramuditā, and this the Vimalā and so on; and that this gives rise to the completion of the perfections, this to meditation on the dharmas on the side of awakening, this to bringing beings to maturity, this to the purification of a buddhafield, this to the forbearance for dharmas that are not produced, this to obtaining many types of meditative stabilization, this to obtaining the dhāraṇī doors, this to obtaining the clairvoyances, and this to obtaining the faculties and so on.

source: གང་སྦྱིན་པའི་དབང་པོ་ཅན་ལ་ཤེས་རབ་ལ་སྦྱོར་བ་དང་། གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ལ་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དང་། གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ལ་ཤེས་རབ་ལ་སྦྱོར་བ་དང་། གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ལ་བཟོད་པ་ལ་སྦྱོར་བ་དང་། གང་བཟོད་པའི་དབང་པོ་ཅན་ལ་ཤེས་རབ་ལ་སྦྱོར་བ་དང་། གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ལ་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དང་། གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ལ་ཤེས་རབ་ལ་སྦྱོར་བ་དང་། གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ལ་བསམ་གཏན་ལ་སྦྱོར་བ་དང་། གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ལ་ཤེས་རབ་ལ་སྦྱོར་བ་དེ་དག་ཀྱང་མཁྱེན་ཏོ། །གང་ཡང་དྲན་པ་ཉེ་བར་གཞག་པའི་དབང་པོ་ཅན་ལ་ཡང་དག་པའི་སྤོང་བ་ལ་སྦྱོར་བ་དང་། གང་ཡང་དག་པའི་སྤོང་བའི་དབང་པོ་ཅན་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སྦྱོར་བ་ཞེས་པ་ལ་སོགས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་སྦྱར་བར་བྱའོ། །གང་ཡང་ནང་སྟོང་པ་ཉིད་ཀྱི་དབང་པོ་ཅན་ལ་ཕྱི་སྟོང་པ་ཉིད་ལ་གནས་ཞེས་བྱ་བ་ལ་སོགས་པས། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ། །གང་ཡང་ཉན་ཐོས་ཀྱི་དབང་པོ་ཅན་ལ་རང་བྱང་ཆུབ་ལ་སྦྱོར་བ་དང་། གང་རང་བྱང་ཆུབ་ཀྱི་དབང་པོ་ཅན་ལ་ཉན་ཐོས་སུ་སྦྱོར་བ་ཅན་དང་། གང་ཉན་ཐོས་ཀྱི་དབང་པོ་ཅན་ལ་རང་སངས་རྒྱས་སུ་སྦྱོར་བ་ཅན་དང་།
en: They know those with a faculty for giving who are practicing morality, and with a faculty for morality who are practicing giving; those with a faculty for giving who are practicing patience, and with a faculty for patience who are practicing giving; those with a faculty for morality who are practicing patience, and with a faculty for patience who are practicing morality; those with a faculty for giving who are practicing perseverance, and with a faculty for perseverance who are practicing giving; those with a faculty for morality who are practicing perseverance, and with a faculty for perseverance who are practicing morality; those with a faculty for patience who are practicing perseverance, and with a faculty for perseverance who are practicing patience; those with a faculty for perseverance who are practicing concentration, and with a faculty for concentration who are practicing perseverance; those with a faculty for concentration who are practicing giving, and with a faculty for giving who are practicing concentration; those with a faculty for concentration who are practicing morality, and with a faculty for morality who are practicing concentration; those with a faculty for concentration who are practicing patience, and with a faculty for patience who are practicing concentration; those with a faculty for wisdom who are practicing giving, and with a faculty for giving who are practicing wisdom; those with a faculty for wisdom who are practicing morality, and with a faculty for morality who are practicing wisdom; those with a faculty for wisdom who are practicing patience, and with a faculty for patience who are practicing wisdom; those with a faculty for wisdom who are practicing perseverance, and with a faculty for perseverance who are practicing wisdom; and those with a faculty for wisdom who are practicing concentration, and with a faculty for concentration who are practicing wisdom.
